EDT_TS/src/Documents/ReceiptOfGoodsAndServises/ReceiptOfGoodsAndServises.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ReceiptOfGoodsAndServises</name>
  <attributes>
    <name>Contractor</name>
    <type>
      <types>CatalogRef.ContractingParties</types>
    </type>
  </attributes>
  <attributes>
    <name>Deal</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Storage</name>
    <type>
      <types>CatalogRef.Storage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>GoodsAndServices</name>
    <attributes>
      <name>GaS</name>
      <type>
        <types>CatalogRef.Nomenklatura</types>
      </type>
    </attributes>
    <attributes>
      <name>UoM</name>
      <type>
        <types>CatalogRef.UnitOfMeasurement</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Summ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT_TS/src/Documents/ReceiptOfGoodsAndServises/ManagerModule.bsl
Процедура PrintRoGaS(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(PrintRoGaS)
	Макет = Документы.ReceiptOfGoodsAndServises.ПолучитьМакет("PrintRoGaS");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ReceiptOfGoodsAndServises.Contractor,
	|	ReceiptOfGoodsAndServises.Deal,
	|	ReceiptOfGoodsAndServises.Storage,
	|	ReceiptOfGoodsAndServises.Дата,
	|	ReceiptOfGoodsAndServises.Номер,
	|	ReceiptOfGoodsAndServises.GoodsAndServices.(
	|		НомерСтроки,
	|		GaS,
	|		UoM,
	|		Amount,
	|		Price,
	|		Summ
	|	)
	|ИЗ
	|	Документ.ReceiptOfGoodsAndServises КАК ReceiptOfGoodsAndServises
	|ГДЕ
	|	ReceiptOfGoodsAndServises.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьGoodsAndServicesШапка = Макет.ПолучитьОбласть("GoodsAndServicesШапка");
	ОбластьGoodsAndServices = Макет.ПолучитьОбласть("GoodsAndServices");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьGoodsAndServicesШапка);
		ВыборкаGoodsAndServices = Выборка.GoodsAndServices.Выбрать();
		Пока ВыборкаGoodsAndServices.Следующий() Цикл
			ОбластьGoodsAndServices.Параметры.Заполнить(ВыборкаGoodsAndServices);
			ТабДок.Вывести(ОбластьGoodsAndServices, ВыборкаGoodsAndServices.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
